GitHub/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеЗаказов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказанныеИзделия</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>DocumentRef.Производство</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GitHub/src/AccumulationRegisters/ЗаказыКлиентов/ЗаказыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыКлиентов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

GitHub/src/Documents/ЗаказКлиента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗаказыКлиентов Приход
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Для Каждого ТекСтрокаЗаказанныеИзделия Из ЗаказанныеИзделия Цикл
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = Ссылка;
		Движение.Номенклатура = ТекСтрокаЗаказанныеИзделия.Изделие;
		Движение.Спецификация = ТекСтрокаЗаказанныеИзделия.Спецификация;
		Движение.Количество = ТекСтрокаЗаказанныеИзделия.Количество;
		Движение.Сумма = ТекСтрокаЗаказанныеИзделия.Сумма;
	КонецЦикла;

	// регистр ПроизводствоИзделий Приход
	//Движения.ПроизводствоИзделий.Записывать = Истина;
	//Для Каждого ТекСтрокаЗаказанныеИзделия Из ЗаказанныеИзделия Цикл
	//	Движение = Движения.ПроизводствоИзделий.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Изделие = ТекСтрокаЗаказанныеИзделия.Изделие;
	//	Движение.Спецификация = ТекСтрокаЗаказанныеИзделия.Спецификация;
	//	Движение.ЗаказКлиента = Ссылка;
	//	Движение.Количество = ТекСтрокаЗаказанныеИзделия.Количество;
	//КонецЦикла;

КонецПроцедуры
